In [1]:
import pandas as pd
import numpy as np

In [2]:
baby = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [3]:
baby.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [4]:
baby.shape

(1016395, 7)

### Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby.columns

Index(['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

##### 특정 칼럼(열) 삭제 방법
- **drop**(columns = [], inplace=True) → 원본 데이터프레임 직접 수정
- **del** baby['']

In [6]:
del baby['Unnamed: 0']

del baby['Id']

baby.columns

Index(['Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

In [7]:
# drop()을 사용할 때는 컬럼명을 리스트([]) 형식으로 전달해야 한다

baby.drop(columns=['Unnamed: 0', 'Id'], inplace=True)

KeyError: "['Unnamed: 0', 'Id'] not found in axis"

### Are there more male or female names in the dataset?

In [8]:
baby['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Group the dataset by name and assign to names

In [9]:
baby.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [11]:
# 이름별로 데이터 집합을 그룹화하고 이름에 할당

# 'Year' 컬럼이 존재하면 .sum()을 적용할 때 불필요한 값이 계산될 수 있다 
names = baby.drop(columns=['Year'], axis=1)

names = names.groupby('Name').sum()

# names = names['Count'].sort_values(ascending=False)
# names.to_frame() # 데이터프레임 형태로 출력 

names = names['Count'].sort_values(ascending=False).to_frame()
names

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

### How many different names exist in the dataset?

In [12]:
baby['Name'].value_counts().sum()

1016395

In [13]:
len(names)

17632

### What is the name with most occurrences?

In [16]:
names['Count'].head(1)

Name
Jacob    242874
Name: Count, dtype: int64

In [17]:
print(names.head(1).index[0])

Jacob

### How many different names have the least occurerrences?

In [21]:
print(len(names.loc[names['Count']==5, :]))

2578

In [23]:
len(names[names['Count'] == names['Count'].min()])

2578

### What is the median name occurrence?

In [25]:
print(names['Count'].median())

49.0

In [27]:
median_names = names.loc[names['Count']==49,:]
sort_names = median_names.sort_values(by='Name', ascending=True) # 알파벳 A부터 정렬
sort_names

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

### What is the standard deviation of names?

In [28]:
names['Count'].std()

11006.0694678915

### Get a summary with the mean, min, max, std, and quartiles.

In [29]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000